import type { Namespace } from "../helpers";

export default {
  ns1: {
    welcome_text: "バリへようこそ。豊かな文化を持つ美しい島です。",
    notification_label: "通知🚀",
    select_lng_value: "言語を変更",
    select_lng_label: "言語を選択",
    dummy_text:
      "可能性に満ちた世界では、すべての言葉が独自の力を持っています。適切に配置されたコンマの単純な優雅さから、綿密に作成された文章の深遠な影響まで、言語は私たちの理解を形作り、認識に色を付けます。私たちは旅に乗り出し、意味の広大な風景を一度に1つのフレーズで探索します。過去の物語の残響は未来の物語のささやきとシームレスに混ざり合い、思考と感情の糸で織りなされたタペストリーを作り出します。",
  },
  speech: {
    title: "潜在能力を解き放つ：モチベーションスピーチ",
    description: {
      part1:
        "皆さん、おはようございます。周りを見渡してください。この部屋のそれぞれの顔には、ユニークな物語、夢、課題、そして無限の可能性が宿っています。時々、慌ただしい生活の中で、私たちは自分の中に宿る、解き放たれるのを待っている信じられないほどの力を忘れてしまいます。",
      part2:
        "今日、私は皆さんにその力を思い出してもらいたいのです。皆さん一人ひとりが、内なる炎、独自の才能、そして本当に並外れたことを成し遂げる能力を持っていることを覚えていてほしいのです。",
      part3:
        "人生は常に楽なわけではありません。私たちは障害に遭遇し、挫折に直面し、疑いの瞬間を経験するでしょう。先行きが不透明に見えたり、期待の重圧がのしかかったり、あるいは恐怖の声が耳元でささやき、諦めるように言ったりする時があるでしょう。",
      part4:
        "しかし、まさにそのような瞬間にこそ、あなたの本当の強さが鍛えられます。不快感を乗り越え、失敗から学び、諦めではなく回復力 を選択することによって、あなたは自分が本当に何ができるのかを発見するのです。",
      part5:
        "あなたが設定した目標、あなたの精神に火をつける願望について考えてみてください。それらは大きいですか？大胆ですか？良いことです。なぜなら、そのような野心的な夢を追求することによって、私たちは成長し、適応し、自分たちの最高のバージョンへと進化するからです。誰にも、特にあなたの中の疑いの声にも、あなたの夢が大きすぎる、非現実的すぎる、あるいは途方もないものだと言わせないでください。",
      part6:
        "どんなに小さくても、一歩一歩前進することは進歩です。間違いから学んだことでさえ、あなたの知恵を築きます。どんなに些細なことでも、勇気ある行動はあなたの決意を強めます。",
    },
  },
} as const satisfies Namespace;
